[
  {
    "name": "Barbell Back Squat",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Barbell Back Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Back_Squat.png"
  },
  {
    "name": "Barbell Front Squat",
    "targetMuscles": [
      "Quadriceps",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Core, performing a controlled Barbell Front Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Front_Squat.png"
  },
  {
    "name": "Goblet Squat",
    "targetMuscles": [
      "Quadriceps",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Core, performing a controlled Goblet Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Goblet_Squat.png"
  },
  {
    "name": "Dumbbell Lunges",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Dumbbell Lunges. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Lunges.png"
  },
  {
    "name": "Walking Lunges",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Walking Lunges. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Walking_Lunges.png"
  },
  {
    "name": "Bulgarian Split Squat",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Bulgarian Split Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bulgarian_Split_Squat.png"
  },
  {
    "name": "Leg Press",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Leg Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Leg_Press.png"
  },
  {
    "name": "Hack Squat",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Hack Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hack_Squat.png"
  },
  {
    "name": "Leg Extension Machine",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Leg Extension Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Leg_Extension_Machine.png"
  },
  {
    "name": "Barbell Deadlift",
    "targetMuscles": [
      "Hamstrings",
      "Lower Back",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Lower Back, Glutes, performing a controlled Barbell Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Deadlift.png"
  },
  {
    "name": "Romanian Deadlift (RDL)",
    "targetMuscles": [
      "Hamstrings",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Glutes, performing a controlled Romanian Deadlift (RDL). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Romanian_Deadlift__RDL_.png"
  },
  {
    "name": "Stiff-Leg Deadlift",
    "targetMuscles": [
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, performing a controlled Stiff-Leg Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Stiff_Leg_Deadlift.png"
  },
  {
    "name": "Sumo Deadlift",
    "targetMuscles": [
      "Glutes",
      "Inner Thighs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Inner Thighs, performing a controlled Sumo Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sumo_Deadlift.png"
  },
  {
    "name": "Lying Leg Curls",
    "targetMuscles": [
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, performing a controlled Lying Leg Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lying_Leg_Curls.png"
  },
  {
    "name": "Seated Leg Curls",
    "targetMuscles": [
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, performing a controlled Seated Leg Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Leg_Curls.png"
  },
  {
    "name": "Standing Calf Raises",
    "targetMuscles": [
      "Calves"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, performing a controlled Standing Calf Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Standing_Calf_Raises.png"
  },
  {
    "name": "Seated Calf Raises",
    "targetMuscles": [
      "Calves"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, performing a controlled Seated Calf Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Calf_Raises.png"
  },
  {
    "name": "Glute Bridge",
    "targetMuscles": [
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, performing a controlled Glute Bridge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Glute_Bridge.png"
  },
  {
    "name": "Barbell Hip Thrust",
    "targetMuscles": [
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, performing a controlled Barbell Hip Thrust. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Hip_Thrust.png"
  },
  {
    "name": "Cable Pull-Throughs",
    "targetMuscles": [
      "Glutes",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, performing a controlled Cable Pull-Throughs. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Pull_Throughs.png"
  },
  {
    "name": "Flat Barbell Bench Press",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Flat Barbell Bench Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Flat_Barbell_Bench_Press.png"
  },
  {
    "name": "Incline Barbell Bench Press",
    "targetMuscles": [
      "Upper Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, performing a controlled Incline Barbell Bench Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Incline_Barbell_Bench_Press.png"
  },
  {
    "name": "Decline Barbell Bench Press",
    "targetMuscles": [
      "Lower Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Chest, performing a controlled Decline Barbell Bench Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Decline_Barbell_Bench_Press.png"
  },
  {
    "name": "Flat Dumbbell Press",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Flat Dumbbell Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Flat_Dumbbell_Press.png"
  },
  {
    "name": "Incline Dumbbell Press",
    "targetMuscles": [
      "Upper Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, performing a controlled Incline Dumbbell Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Incline_Dumbbell_Press.png"
  },
  {
    "name": "Decline Dumbbell Press",
    "targetMuscles": [
      "Lower Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Chest, performing a controlled Decline Dumbbell Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Decline_Dumbbell_Press.png"
  },
  {
    "name": "Dumbbell Chest Fly",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Dumbbell Chest Fly. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Chest_Fly.png"
  },
  {
    "name": "Incline Dumbbell Fly",
    "targetMuscles": [
      "Upper Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, performing a controlled Incline Dumbbell Fly. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Incline_Dumbbell_Fly.png"
  },
  {
    "name": "Cable Crossovers (High to Low)",
    "targetMuscles": [
      "Lower Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Chest, performing a controlled Cable Crossovers (High to Low). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Crossovers__High_to_Low_.png"
  },
  {
    "name": "Cable Crossovers (Low to High)",
    "targetMuscles": [
      "Upper Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, performing a controlled Cable Crossovers (Low to High). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Crossovers__Low_to_High_.png"
  },
  {
    "name": "Pec Deck Machine",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Pec Deck Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Pec_Deck_Machine.png"
  },
  {
    "name": "Machine Chest Press",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Machine Chest Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Machine_Chest_Press.png"
  },
  {
    "name": "Push-Ups",
    "targetMuscles": [
      "Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Triceps, performing a controlled Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Push_Ups.png"
  },
  {
    "name": "Dips (Chest Focus)",
    "targetMuscles": [
      "Lower Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Chest, Triceps, performing a controlled Dips (Chest Focus). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dips__Chest_Focus_.png"
  },
  {
    "name": "Pull-Ups (Wide Grip)",
    "targetMuscles": [
      "Lats (Back)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats (Back), performing a controlled Pull-Ups (Wide Grip). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Pull_Ups__Wide_Grip_.png"
  },
  {
    "name": "Chin-Ups",
    "targetMuscles": [
      "Lats",
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Biceps, performing a controlled Chin-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Chin_Ups.png"
  },
  {
    "name": "Lat Pulldown (Wide Grip)",
    "targetMuscles": [
      "Lats (Back)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats (Back), performing a controlled Lat Pulldown (Wide Grip). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lat_Pulldown__Wide_Grip_.png"
  },
  {
    "name": "Lat Pulldown (Close Grip)",
    "targetMuscles": [
      "Lats",
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Biceps, performing a controlled Lat Pulldown (Close Grip). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lat_Pulldown__Close_Grip_.png"
  },
  {
    "name": "Barbell Bent Over Row",
    "targetMuscles": [
      "Middle Back",
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, Lats, performing a controlled Barbell Bent Over Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Bent_Over_Row.png"
  },
  {
    "name": "Dumbbell Single Arm Row",
    "targetMuscles": [
      "Lats (Back)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats (Back), performing a controlled Dumbbell Single Arm Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Single_Arm_Row.png"
  },
  {
    "name": "Seated Cable Row",
    "targetMuscles": [
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, performing a controlled Seated Cable Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Cable_Row.png"
  },
  {
    "name": "T-Bar Row",
    "targetMuscles": [
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, performing a controlled T-Bar Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/T_Bar_Row.png"
  },
  {
    "name": "Face Pulls",
    "targetMuscles": [
      "Rear Delts",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, Upper Back, performing a controlled Face Pulls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Face_Pulls.png"
  },
  {
    "name": "Straight Arm Pulldown",
    "targetMuscles": [
      "Lats (Back)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats (Back), performing a controlled Straight Arm Pulldown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Straight_Arm_Pulldown.png"
  },
  {
    "name": "Hyperextensions (Back Extension)",
    "targetMuscles": [
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, performing a controlled Hyperextensions (Back Extension). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hyperextensions__Back_Extension_.png"
  },
  {
    "name": "Barbell Overhead Press (Military)",
    "targetMuscles": [
      "Shoulders (Front Delts)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders (Front Delts), performing a controlled Barbell Overhead Press (Military). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Overhead_Press__Military_.png"
  },
  {
    "name": "Seated Dumbbell Shoulder Press",
    "targetMuscles": [
      "Shoulders (Front Delts)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders (Front Delts), performing a controlled Seated Dumbbell Shoulder Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Dumbbell_Shoulder_Press.png"
  },
  {
    "name": "Arnold Press",
    "targetMuscles": [
      "Shoulders (All Heads)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders (All Heads), performing a controlled Arnold Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Arnold_Press.png"
  },
  {
    "name": "Dumbbell Lateral Raises",
    "targetMuscles": [
      "Side Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, performing a controlled Dumbbell Lateral Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Lateral_Raises.png"
  },
  {
    "name": "Cable Lateral Raises",
    "targetMuscles": [
      "Side Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, performing a controlled Cable Lateral Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Lateral_Raises.png"
  },
  {
    "name": "Dumbbell Front Raises",
    "targetMuscles": [
      "Front Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Front Delts, performing a controlled Dumbbell Front Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Front_Raises.png"
  },
  {
    "name": "Plate Front Raises",
    "targetMuscles": [
      "Front Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Front Delts, performing a controlled Plate Front Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Plate_Front_Raises.png"
  },
  {
    "name": "Reverse Pec Deck (Rear Delt Fly)",
    "targetMuscles": [
      "Rear Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, performing a controlled Reverse Pec Deck (Rear Delt Fly). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Reverse_Pec_Deck__Rear_Delt_Fly_.png"
  },
  {
    "name": "Bent Over Dumbbell Reverse Fly",
    "targetMuscles": [
      "Rear Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, performing a controlled Bent Over Dumbbell Reverse Fly. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bent_Over_Dumbbell_Reverse_Fly.png"
  },
  {
    "name": "Barbell Shrugs",
    "targetMuscles": [
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Traps, performing a controlled Barbell Shrugs. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Shrugs.png"
  },
  {
    "name": "Dumbbell Shrugs",
    "targetMuscles": [
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Traps, performing a controlled Dumbbell Shrugs. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Shrugs.png"
  },
  {
    "name": "Upright Row",
    "targetMuscles": [
      "Side Delts",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, Traps, performing a controlled Upright Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Upright_Row.png"
  },
  {
    "name": "Barbell Bicep Curl",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Barbell Bicep Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Barbell_Bicep_Curl.png"
  },
  {
    "name": "Dumbbell Bicep Curl",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Dumbbell Bicep Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Bicep_Curl.png"
  },
  {
    "name": "Hammer Curls",
    "targetMuscles": [
      "Biceps",
      "Forearms"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, Forearms, performing a controlled Hammer Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hammer_Curls.png"
  },
  {
    "name": "Preacher Curl (EZ Bar)",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Preacher Curl (EZ Bar). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Preacher_Curl__EZ_Bar_.png"
  },
  {
    "name": "Concentration Curls",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Concentration Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Concentration_Curls.png"
  },
  {
    "name": "Incline Dumbbell Curls",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Incline Dumbbell Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Incline_Dumbbell_Curls.png"
  },
  {
    "name": "Cable Bicep Curls",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Cable Bicep Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Bicep_Curls.png"
  },
  {
    "name": "Tricep Rope Pushdown",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Tricep Rope Pushdown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Tricep_Rope_Pushdown.png"
  },
  {
    "name": "Tricep Bar Pushdown",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Tricep Bar Pushdown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Tricep_Bar_Pushdown.png"
  },
  {
    "name": "Skull Crushers (EZ Bar)",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Skull Crushers (EZ Bar). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Skull_Crushers__EZ_Bar_.png"
  },
  {
    "name": "Overhead Dumbbell Extension",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Overhead Dumbbell Extension. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Overhead_Dumbbell_Extension.png"
  },
  {
    "name": "Dips (Tricep Focus)",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Dips (Tricep Focus). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dips__Tricep_Focus_.png"
  },
  {
    "name": "Close Grip Bench Press",
    "targetMuscles": [
      "Triceps",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, Chest, performing a controlled Close Grip Bench Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Close_Grip_Bench_Press.png"
  },
  {
    "name": "Dumbbell Kickbacks",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Dumbbell Kickbacks. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Kickbacks.png"
  },
  {
    "name": "Plank",
    "targetMuscles": [
      "Core (Abs)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Abs), performing a controlled Plank. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Plank.png"
  },
  {
    "name": "Side Plank",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Side Plank. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Side_Plank.png"
  },
  {
    "name": "Hanging Leg Raises",
    "targetMuscles": [
      "Lower Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Abs, performing a controlled Hanging Leg Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hanging_Leg_Raises.png"
  },
  {
    "name": "Captain's Chair Leg Raises",
    "targetMuscles": [
      "Lower Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Abs, performing a controlled Captain's Chair Leg Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Captain_s_Chair_Leg_Raises.png"
  },
  {
    "name": "Cable Crunches",
    "targetMuscles": [
      "Upper Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Abs, performing a controlled Cable Crunches. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Crunches.png"
  },
  {
    "name": "Russian Twists",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Russian Twists. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Russian_Twists.png"
  },
  {
    "name": "Ab Wheel Rollout",
    "targetMuscles": [
      "Core (Abs)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Abs), performing a controlled Ab Wheel Rollout. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Ab_Wheel_Rollout.png"
  },
  {
    "name": "Bicycle Crunches",
    "targetMuscles": [
      "Core (Abs)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Abs), performing a controlled Bicycle Crunches. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bicycle_Crunches.png"
  },
  {
    "name": "Mountain Climbers",
    "targetMuscles": [
      "Core",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Cardio, performing a controlled Mountain Climbers. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Mountain_Climbers.png"
  },
  {
    "name": "Burpees",
    "targetMuscles": [
      "Full Body",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Cardio, performing a controlled Burpees. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Burpees.png"
  },
  {
    "name": "Box Jumps",
    "targetMuscles": [
      "Legs",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Cardio, performing a controlled Box Jumps. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Box_Jumps.png"
  },
  {
    "name": "Kettlebell Swings",
    "targetMuscles": [
      "Glutes",
      "Hamstrings",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, Cardio, performing a controlled Kettlebell Swings. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Swings.png"
  },
  {
    "name": "Battle Ropes",
    "targetMuscles": [
      "Shoulders",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Cardio, performing a controlled Battle Ropes. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Battle_Ropes.png"
  },
  {
    "name": "Jump Rope",
    "targetMuscles": [
      "Calves",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, Cardio, performing a controlled Jump Rope. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Jump_Rope.png"
  },
  {
    "name": "Sled Push",
    "targetMuscles": [
      "Quadriceps",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Cardio, performing a controlled Sled Push. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sled_Push.png"
  },
  {
    "name": "Farmers Walk",
    "targetMuscles": [
      "Forearms",
      "Traps",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms, Traps, Core, performing a controlled Farmers Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Farmers_Walk.png"
  },
  {
    "name": "Clean and Jerk",
    "targetMuscles": [
      "Full Body (Olympic)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body (Olympic), performing a controlled Clean and Jerk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Clean_and_Jerk.png"
  },
  {
    "name": "Snatch",
    "targetMuscles": [
      "Full Body (Olympic)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body (Olympic), performing a controlled Snatch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Snatch.png"
  },
  {
    "name": "Thrusters",
    "targetMuscles": [
      "Quadriceps",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Shoulders, performing a controlled Thrusters. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Thrusters.png"
  },
  {
    "name": "Renegade Rows",
    "targetMuscles": [
      "Core",
      "Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Back, performing a controlled Renegade Rows. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Renegade_Rows.png"
  },
  {
    "name": "Landmine Press",
    "targetMuscles": [
      "Upper Chest",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, Shoulders, performing a controlled Landmine Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Landmine_Press.png"
  },
  {
    "name": "Good Mornings",
    "targetMuscles": [
      "Hamstrings",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Lower Back, performing a controlled Good Mornings. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Good_Mornings.png"
  },
  {
    "name": "Hack Squat Machine",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Hack Squat Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hack_Squat_Machine.png"
  },
  {
    "name": "Smith Machine Squat",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Smith Machine Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Smith_Machine_Squat.png"
  },
  {
    "name": "Assisted Pull-Up Machine",
    "targetMuscles": [
      "Lats (Back)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats (Back), performing a controlled Assisted Pull-Up Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Assisted_Pull_Up_Machine.png"
  },
  {
    "name": "TRX Rows",
    "targetMuscles": [
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, performing a controlled TRX Rows. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/TRX_Rows.png"
  },
  {
    "name": "TRX Pistol Squat",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled TRX Pistol Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/TRX_Pistol_Squat.png"
  },
  {
    "name": "Medicine Ball Slams",
    "targetMuscles": [
      "Core",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Cardio, performing a controlled Medicine Ball Slams. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Medicine_Ball_Slams.png"
  },
  {
    "name": "Dumbbell Step-Ups",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Dumbbell Step-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Step_Ups.png"
  },
  {
    "name": "Reverse Lunges",
    "targetMuscles": [
      "Glutes",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, performing a controlled Reverse Lunges. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Reverse_Lunges.png"
  },
  {
    "name": "Lateral Lunges (Side Lunges)",
    "targetMuscles": [
      "Glutes",
      "Adductors (Inner Thigh)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Adductors (Inner Thigh), performing a controlled Lateral Lunges (Side Lunges). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lateral_Lunges__Side_Lunges_.png"
  },
  {
    "name": "Curtsy Lunges",
    "targetMuscles": [
      "Glutes (Medius)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), performing a controlled Curtsy Lunges. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Curtsy_Lunges.png"
  },
  {
    "name": "Sissy Squat (Bodyweight/Weighted)",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Sissy Squat (Bodyweight/Weighted). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sissy_Squat__Bodyweight_Weighted_.png"
  },
  {
    "name": "Smith Machine Lunges",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Smith Machine Lunges. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Smith_Machine_Lunges.png"
  },
  {
    "name": "Cable Kickbacks",
    "targetMuscles": [
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, performing a controlled Cable Kickbacks. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Kickbacks.png"
  },
  {
    "name": "Cable Abductions (Side Leg Raise)",
    "targetMuscles": [
      "Glutes (Medius)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), performing a controlled Cable Abductions (Side Leg Raise). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Abductions__Side_Leg_Raise_.png"
  },
  {
    "name": "Seated Hip Abduction Machine",
    "targetMuscles": [
      "Glutes",
      "Outer Thigh"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Outer Thigh, performing a controlled Seated Hip Abduction Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Hip_Abduction_Machine.png"
  },
  {
    "name": "Seated Hip Adduction Machine",
    "targetMuscles": [
      "Adductors (Inner Thigh)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors (Inner Thigh), performing a controlled Seated Hip Adduction Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Hip_Adduction_Machine.png"
  },
  {
    "name": "Single-Leg RDL (Dumbbell)",
    "targetMuscles": [
      "Hamstrings",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Balance, performing a controlled Single-Leg RDL (Dumbbell). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Leg_RDL__Dumbbell_.png"
  },
  {
    "name": "Single-Leg Leg Press",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Single-Leg Leg Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Leg_Leg_Press.png"
  },
  {
    "name": "Trap Bar Deadlift",
    "targetMuscles": [
      "Quadriceps",
      "Glutes",
      "Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, Back, performing a controlled Trap Bar Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Trap_Bar_Deadlift.png"
  },
  {
    "name": "Deficit Deadlift",
    "targetMuscles": [
      "Hamstrings",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Lower Back, performing a controlled Deficit Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Deficit_Deadlift.png"
  },
  {
    "name": "Rack Pulls",
    "targetMuscles": [
      "Upper Back",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back, Traps, performing a controlled Rack Pulls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Rack_Pulls.png"
  },
  {
    "name": "Dumbbell Pullover",
    "targetMuscles": [
      "Lats",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Chest, performing a controlled Dumbbell Pullover. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dumbbell_Pullover.png"
  },
  {
    "name": "Cable Pullover (Straight Arm)",
    "targetMuscles": [
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, performing a controlled Cable Pullover (Straight Arm). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Pullover__Straight_Arm_.png"
  },
  {
    "name": "Seal Row (Chest Supported)",
    "targetMuscles": [
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, performing a controlled Seal Row (Chest Supported). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seal_Row__Chest_Supported_.png"
  },
  {
    "name": "Meadows Row",
    "targetMuscles": [
      "Lats",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Upper Back, performing a controlled Meadows Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Meadows_Row.png"
  },
  {
    "name": "Kroc Rows",
    "targetMuscles": [
      "Lats",
      "Grip Strength"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Grip Strength, performing a controlled Kroc Rows. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kroc_Rows.png"
  },
  {
    "name": "Pendlay Row",
    "targetMuscles": [
      "Lats",
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Middle Back, performing a controlled Pendlay Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Pendlay_Row.png"
  },
  {
    "name": "Yates Row",
    "targetMuscles": [
      "Lats",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Upper Back, performing a controlled Yates Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Yates_Row.png"
  },
  {
    "name": "Single-Arm Lat Pulldown",
    "targetMuscles": [
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, performing a controlled Single-Arm Lat Pulldown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Arm_Lat_Pulldown.png"
  },
  {
    "name": "Underhand Grip Lat Pulldown",
    "targetMuscles": [
      "Lats",
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Biceps, performing a controlled Underhand Grip Lat Pulldown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Underhand_Grip_Lat_Pulldown.png"
  },
  {
    "name": "V-Bar Lat Pulldown",
    "targetMuscles": [
      "Lats",
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Middle Back, performing a controlled V-Bar Lat Pulldown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/V_Bar_Lat_Pulldown.png"
  },
  {
    "name": "Behind-the-Neck Pulldown",
    "targetMuscles": [
      "Lats",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Upper Back, performing a controlled Behind-the-Neck Pulldown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Behind_the_Neck_Pulldown.png"
  },
  {
    "name": "Incline Bench Row (Dumbbell)",
    "targetMuscles": [
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, performing a controlled Incline Bench Row (Dumbbell). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Incline_Bench_Row__Dumbbell_.png"
  },
  {
    "name": "Seated Machine Row (Neutral Grip)",
    "targetMuscles": [
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, performing a controlled Seated Machine Row (Neutral Grip). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Machine_Row__Neutral_Grip_.png"
  },
  {
    "name": "Seated Machine Row (Wide Grip)",
    "targetMuscles": [
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back, performing a controlled Seated Machine Row (Wide Grip). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Machine_Row__Wide_Grip_.png"
  },
  {
    "name": "Back Extensions (Weighted)",
    "targetMuscles": [
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, performing a controlled Back Extensions (Weighted). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Back_Extensions__Weighted_.png"
  },
  {
    "name": "Superman",
    "targetMuscles": [
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, performing a controlled Superman. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Superman.png"
  },
  {
    "name": "Guillotine Press",
    "targetMuscles": [
      "Upper Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, performing a controlled Guillotine Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Guillotine_Press.png"
  },
  {
    "name": "Floor Press (Barbell)",
    "targetMuscles": [
      "Triceps",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, Chest, performing a controlled Floor Press (Barbell). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Floor_Press__Barbell_.png"
  },
  {
    "name": "Floor Press (Dumbbell)",
    "targetMuscles": [
      "Triceps",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, Chest, performing a controlled Floor Press (Dumbbell). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Floor_Press__Dumbbell_.png"
  },
  {
    "name": "Svend Press",
    "targetMuscles": [
      "Inner Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Inner Chest, performing a controlled Svend Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Svend_Press.png"
  },
  {
    "name": "Landmine Chest Press",
    "targetMuscles": [
      "Upper Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, performing a controlled Landmine Chest Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Landmine_Chest_Press.png"
  },
  {
    "name": "Cable Fly (Middle Setting)",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Cable Fly (Middle Setting). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Fly__Middle_Setting_.png"
  },
  {
    "name": "Single-Arm Cable Chest Press",
    "targetMuscles": [
      "Chest",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Core, performing a controlled Single-Arm Cable Chest Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Arm_Cable_Chest_Press.png"
  },
  {
    "name": "Machine Fly (Pec Deck)",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Machine Fly (Pec Deck). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Machine_Fly__Pec_Deck_.png"
  },
  {
    "name": "Bosu Ball Push-Ups",
    "targetMuscles": [
      "Chest",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Core, performing a controlled Bosu Ball Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bosu_Ball_Push_Ups.png"
  },
  {
    "name": "Diamond Push-Ups",
    "targetMuscles": [
      "Triceps",
      "Inner Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, Inner Chest, performing a controlled Diamond Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Diamond_Push_Ups.png"
  },
  {
    "name": "Decline Push-Ups",
    "targetMuscles": [
      "Upper Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, performing a controlled Decline Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Decline_Push_Ups.png"
  },
  {
    "name": "Archer Push-Ups",
    "targetMuscles": [
      "Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Triceps, performing a controlled Archer Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Archer_Push_Ups.png"
  },
  {
    "name": "Spider Curls",
    "targetMuscles": [
      "Biceps (Short Head)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps (Short Head), performing a controlled Spider Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Spider_Curls.png"
  },
  {
    "name": "Drag Curls",
    "targetMuscles": [
      "Biceps (Long Head)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps (Long Head), performing a controlled Drag Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Drag_Curls.png"
  },
  {
    "name": "Zottman Curls",
    "targetMuscles": [
      "Biceps",
      "Forearms"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, Forearms, performing a controlled Zottman Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Zottman_Curls.png"
  },
  {
    "name": "Reverse Barbell Curl",
    "targetMuscles": [
      "Forearms",
      "Brachialis"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms, Brachialis, performing a controlled Reverse Barbell Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Reverse_Barbell_Curl.png"
  },
  {
    "name": "Wrist Curls (Palms Up)",
    "targetMuscles": [
      "Forearms (Flexors)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms (Flexors), performing a controlled Wrist Curls (Palms Up). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wrist_Curls__Palms_Up_.png"
  },
  {
    "name": "Wrist Extensions (Palms Down)",
    "targetMuscles": [
      "Forearms (Extensors)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms (Extensors), performing a controlled Wrist Extensions (Palms Down). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wrist_Extensions__Palms_Down_.png"
  },
  {
    "name": "Plate Pinch Hold",
    "targetMuscles": [
      "Forearms",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms, Grip, performing a controlled Plate Pinch Hold. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Plate_Pinch_Hold.png"
  },
  {
    "name": "Waiter Curls",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Waiter Curls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Waiter_Curls.png"
  },
  {
    "name": "Cable Hammer Curls (Rope)",
    "targetMuscles": [
      "Biceps",
      "Forearms"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, Forearms, performing a controlled Cable Hammer Curls (Rope). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Hammer_Curls__Rope_.png"
  },
  {
    "name": "Single-Arm High Cable Curl",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Single-Arm High Cable Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Arm_High_Cable_Curl.png"
  },
  {
    "name": "Tate Press",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Tate Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Tate_Press.png"
  },
  {
    "name": "JM Press",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled JM Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/JM_Press.png"
  },
  {
    "name": "Overhead Cable Extension (Rope)",
    "targetMuscles": [
      "Triceps (Long Head)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps (Long Head), performing a controlled Overhead Cable Extension (Rope). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Overhead_Cable_Extension__Rope_.png"
  },
  {
    "name": "Single-Arm Reverse Grip Pushdown",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Single-Arm Reverse Grip Pushdown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Arm_Reverse_Grip_Pushdown.png"
  },
  {
    "name": "Bench Dips (Weighted)",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Bench Dips (Weighted). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bench_Dips__Weighted_.png"
  },
  {
    "name": "Close-Grip Push-Ups",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Close-Grip Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Close_Grip_Push_Ups.png"
  },
  {
    "name": "Cuban Press",
    "targetMuscles": [
      "Rotator Cuff",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rotator Cuff, Shoulders, performing a controlled Cuban Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cuban_Press.png"
  },
  {
    "name": "Bradford Press",
    "targetMuscles": [
      "Shoulders (Front/Rear)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders (Front/Rear), performing a controlled Bradford Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bradford_Press.png"
  },
  {
    "name": "Landmine Shoulder Press",
    "targetMuscles": [
      "Shoulders (Front Delts)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders (Front Delts), performing a controlled Landmine Shoulder Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Landmine_Shoulder_Press.png"
  },
  {
    "name": "Single-Arm Dumbbell Snatch",
    "targetMuscles": [
      "Full Body",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Shoulders, performing a controlled Single-Arm Dumbbell Snatch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Arm_Dumbbell_Snatch.png"
  },
  {
    "name": "Pike Push-Ups",
    "targetMuscles": [
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, performing a controlled Pike Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Pike_Push_Ups.png"
  },
  {
    "name": "Handstand Push-Ups",
    "targetMuscles": [
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, performing a controlled Handstand Push-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Handstand_Push_Ups.png"
  },
  {
    "name": "Scaption (Y-Raise)",
    "targetMuscles": [
      "Side Delts",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, Traps, performing a controlled Scaption (Y-Raise). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Scaption__Y_Raise_.png"
  },
  {
    "name": "Rear Delt Rope Pull (Face Pull Variation)",
    "targetMuscles": [
      "Rear Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, performing a controlled Rear Delt Rope Pull (Face Pull Variation). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Rear_Delt_Rope_Pull__Face_Pull_Variation_.png"
  },
  {
    "name": "Cable Upright Row",
    "targetMuscles": [
      "Side Delts",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, Traps, performing a controlled Cable Upright Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Upright_Row.png"
  },
  {
    "name": "Behind-the-Back Shrugs",
    "targetMuscles": [
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Traps, performing a controlled Behind-the-Back Shrugs. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Behind_the_Back_Shrugs.png"
  },
  {
    "name": "Hanging Knee Raises",
    "targetMuscles": [
      "Lower Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Abs, performing a controlled Hanging Knee Raises. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hanging_Knee_Raises.png"
  },
  {
    "name": "Toes-to-Bar",
    "targetMuscles": [
      "Core",
      "Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Abs, performing a controlled Toes-to-Bar. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Toes_to_Bar.png"
  },
  {
    "name": "Decline Bench Crunches",
    "targetMuscles": [
      "Upper Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Abs, performing a controlled Decline Bench Crunches. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Decline_Bench_Crunches.png"
  },
  {
    "name": "Weighted Sit-Ups",
    "targetMuscles": [
      "Upper Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Abs, performing a controlled Weighted Sit-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Weighted_Sit_Ups.png"
  },
  {
    "name": "Flutter Kicks",
    "targetMuscles": [
      "Lower Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Abs, performing a controlled Flutter Kicks. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Flutter_Kicks.png"
  },
  {
    "name": "V-Ups",
    "targetMuscles": [
      "Core (Abs)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Abs), performing a controlled V-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/V_Ups.png"
  },
  {
    "name": "Hollow Body Hold",
    "targetMuscles": [
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, performing a controlled Hollow Body Hold. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hollow_Body_Hold.png"
  },
  {
    "name": "Pallof Press",
    "targetMuscles": [
      "Core (Obliques)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Obliques), performing a controlled Pallof Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Pallof_Press.png"
  },
  {
    "name": "Woodchoppers (High to Low)",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Woodchoppers (High to Low). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Woodchoppers__High_to_Low_.png"
  },
  {
    "name": "Woodchoppers (Low to High)",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Woodchoppers (Low to High). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Woodchoppers__Low_to_High_.png"
  },
  {
    "name": "L-Sit",
    "targetMuscles": [
      "Core",
      "Hip Flexors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Hip Flexors, performing a controlled L-Sit. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/L_Sit.png"
  },
  {
    "name": "Ab Vacuum",
    "targetMuscles": [
      "Transverse Abdominis"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Transverse Abdominis, performing a controlled Ab Vacuum. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Ab_Vacuum.png"
  },
  {
    "name": "Side Bends (Dumbbell)",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Side Bends (Dumbbell). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Side_Bends__Dumbbell_.png"
  },
  {
    "name": "Standing Cable Crunch",
    "targetMuscles": [
      "Upper Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Abs, performing a controlled Standing Cable Crunch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Standing_Cable_Crunch.png"
  },
  {
    "name": "Sled Pull (Backwards)",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Sled Pull (Backwards). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sled_Pull__Backwards_.png"
  },
  {
    "name": "Prowler Push",
    "targetMuscles": [
      "Legs",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Cardio, performing a controlled Prowler Push. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Prowler_Push.png"
  },
  {
    "name": "Tire Flips",
    "targetMuscles": [
      "Full Body"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, performing a controlled Tire Flips. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Tire_Flips.png"
  },
  {
    "name": "Wall Balls",
    "targetMuscles": [
      "Legs",
      "Shoulders",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Shoulders, Cardio, performing a controlled Wall Balls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wall_Balls.png"
  },
  {
    "name": "Box Step-Overs",
    "targetMuscles": [
      "Legs",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Cardio, performing a controlled Box Step-Overs. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Box_Step_Overs.png"
  },
  {
    "name": "Broad Jumps",
    "targetMuscles": [
      "Legs",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Power, performing a controlled Broad Jumps. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Broad_Jumps.png"
  },
  {
    "name": "Single-Unders (Jump Rope)",
    "targetMuscles": [
      "Calves",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, Cardio, performing a controlled Single-Unders (Jump Rope). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Unders__Jump_Rope_.png"
  },
  {
    "name": "Double-Unders (Jump Rope)",
    "targetMuscles": [
      "Calves",
      "Cardio",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, Cardio, Coordination, performing a controlled Double-Unders (Jump Rope). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Unders__Jump_Rope_.png"
  },
  {
    "name": "Rowing Machine (Erg)",
    "targetMuscles": [
      "Full Body",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Cardio, performing a controlled Rowing Machine (Erg). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Rowing_Machine__Erg_.png"
  },
  {
    "name": "Assault Bike / Air Bike",
    "targetMuscles": [
      "Legs",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Cardio, performing a controlled Assault Bike / Air Bike. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Assault_Bike___Air_Bike.png"
  },
  {
    "name": "Stairmaster",
    "targetMuscles": [
      "Glutes",
      "Calves",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Calves, Cardio, performing a controlled Stairmaster. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Stairmaster.png"
  },
  {
    "name": "Jacobs Ladder",
    "targetMuscles": [
      "Full Body",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Cardio, performing a controlled Jacobs Ladder. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Jacobs_Ladder.png"
  },
  {
    "name": "Elliptical",
    "targetMuscles": [
      "Cardio (Low Impact)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Cardio (Low Impact), performing a controlled Elliptical. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Elliptical.png"
  },
  {
    "name": "Treadmill Incline Walk",
    "targetMuscles": [
      "Glutes",
      "Calves",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Calves, Cardio, performing a controlled Treadmill Incline Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Treadmill_Incline_Walk.png"
  },
  {
    "name": "Cable Front Raise",
    "targetMuscles": [
      "Front Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Front Delts, performing a controlled Cable Front Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Front_Raise.png"
  },
  {
    "name": "Plate Truck Driver",
    "targetMuscles": [
      "Front Delts",
      "Rotator Cuff"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Front Delts, Rotator Cuff, performing a controlled Plate Truck Driver. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Plate_Truck_Driver.png"
  },
  {
    "name": "Kettlebell Swing (Two-Handed)",
    "targetMuscles": [
      "Glutes",
      "Hamstrings",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, Core, performing a controlled Kettlebell Swing (Two-Handed). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Swing__Two_Handed_.png"
  },
  {
    "name": "Kettlebell Swing (One-Handed)",
    "targetMuscles": [
      "Glutes",
      "Core",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Core, Grip, performing a controlled Kettlebell Swing (One-Handed). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Swing__One_Handed_.png"
  },
  {
    "name": "Russian Kettlebell Swing",
    "targetMuscles": [
      "Glutes",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, performing a controlled Russian Kettlebell Swing. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Russian_Kettlebell_Swing.png"
  },
  {
    "name": "American Kettlebell Swing",
    "targetMuscles": [
      "Glutes",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Shoulders, performing a controlled American Kettlebell Swing. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/American_Kettlebell_Swing.png"
  },
  {
    "name": "Alternating Kettlebell Swing",
    "targetMuscles": [
      "Glutes",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Coordination, performing a controlled Alternating Kettlebell Swing. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Alternating_Kettlebell_Swing.png"
  },
  {
    "name": "Kettlebell Goblet Squat",
    "targetMuscles": [
      "Quadriceps",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Core, performing a controlled Kettlebell Goblet Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Goblet_Squat.png"
  },
  {
    "name": "Kettlebell Front Squat (Double)",
    "targetMuscles": [
      "Quadriceps",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Upper Back, performing a controlled Kettlebell Front Squat (Double). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Front_Squat__Double_.png"
  },
  {
    "name": "Kettlebell Sumo Deadlift",
    "targetMuscles": [
      "Glutes",
      "Inner Thighs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Inner Thighs, performing a controlled Kettlebell Sumo Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Sumo_Deadlift.png"
  },
  {
    "name": "Kettlebell RDL (Romanian Deadlift)",
    "targetMuscles": [
      "Hamstrings",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Glutes, performing a controlled Kettlebell RDL (Romanian Deadlift). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_RDL__Romanian_Deadlift_.png"
  },
  {
    "name": "Single-Leg Kettlebell RDL",
    "targetMuscles": [
      "Hamstrings",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Balance, performing a controlled Single-Leg Kettlebell RDL. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Leg_Kettlebell_RDL.png"
  },
  {
    "name": "Kettlebell Clean",
    "targetMuscles": [
      "Hips",
      "Traps",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Traps, Grip, performing a controlled Kettlebell Clean. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Clean.png"
  },
  {
    "name": "Kettlebell Clean and Press",
    "targetMuscles": [
      "Full Body",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Shoulders, performing a controlled Kettlebell Clean and Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Clean_and_Press.png"
  },
  {
    "name": "Kettlebell Snatch",
    "targetMuscles": [
      "Full Body",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Power, performing a controlled Kettlebell Snatch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Snatch.png"
  },
  {
    "name": "Kettlebell High Pull",
    "targetMuscles": [
      "Traps",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Traps, Upper Back, performing a controlled Kettlebell High Pull. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_High_Pull.png"
  },
  {
    "name": "Turkish Get-Up",
    "targetMuscles": [
      "Full Body",
      "Core Stability"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Core Stability, performing a controlled Turkish Get-Up. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Turkish_Get_Up.png"
  },
  {
    "name": "Kettlebell Windmill",
    "targetMuscles": [
      "Obliques",
      "Shoulder Stability"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Shoulder Stability, performing a controlled Kettlebell Windmill. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Windmill.png"
  },
  {
    "name": "Kettlebell Halo",
    "targetMuscles": [
      "Shoulders",
      "Mobility"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Mobility, performing a controlled Kettlebell Halo. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Halo.png"
  },
  {
    "name": "Kettlebell Around the World",
    "targetMuscles": [
      "Core",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Grip, performing a controlled Kettlebell Around the World. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Around_the_World.png"
  },
  {
    "name": "Kettlebell Figure 8",
    "targetMuscles": [
      "Quadriceps",
      "Core",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Core, Coordination, performing a controlled Kettlebell Figure 8. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Figure_8.png"
  },
  {
    "name": "Kettlebell Slingshot",
    "targetMuscles": [
      "Core",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Grip, performing a controlled Kettlebell Slingshot. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Slingshot.png"
  },
  {
    "name": "Kettlebell Overhead Press (Strict)",
    "targetMuscles": [
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, performing a controlled Kettlebell Overhead Press (Strict). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Overhead_Press__Strict_.png"
  },
  {
    "name": "Kettlebell Push Press",
    "targetMuscles": [
      "Shoulders",
      "Legs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Legs, performing a controlled Kettlebell Push Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Push_Press.png"
  },
  {
    "name": "Kettlebell Jerk",
    "targetMuscles": [
      "Shoulders",
      "Legs",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Legs, Power, performing a controlled Kettlebell Jerk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Jerk.png"
  },
  {
    "name": "Kettlebell Thruster",
    "targetMuscles": [
      "Quadriceps",
      "Shoulders",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Shoulders, Cardio, performing a controlled Kettlebell Thruster. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Thruster.png"
  },
  {
    "name": "Kettlebell Floor Press",
    "targetMuscles": [
      "Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Triceps, performing a controlled Kettlebell Floor Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Floor_Press.png"
  },
  {
    "name": "Kettlebell Bridge Press",
    "targetMuscles": [
      "Chest",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Glutes, performing a controlled Kettlebell Bridge Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Bridge_Press.png"
  },
  {
    "name": "Kettlebell Crush Grip Push-Up",
    "targetMuscles": [
      "Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Triceps, performing a controlled Kettlebell Crush Grip Push-Up. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Crush_Grip_Push_Up.png"
  },
  {
    "name": "Kettlebell Renegade Row",
    "targetMuscles": [
      "Back",
      "Core (Anti-Rotation)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Back, Core (Anti-Rotation), performing a controlled Kettlebell Renegade Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Renegade_Row.png"
  },
  {
    "name": "Kettlebell Gorilla Row",
    "targetMuscles": [
      "Lats",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Lower Back, performing a controlled Kettlebell Gorilla Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Gorilla_Row.png"
  },
  {
    "name": "Kettlebell Bent Over Row",
    "targetMuscles": [
      "Lats",
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Middle Back, performing a controlled Kettlebell Bent Over Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Bent_Over_Row.png"
  },
  {
    "name": "Kettlebell Upright Row",
    "targetMuscles": [
      "Shoulders",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Traps, performing a controlled Kettlebell Upright Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Upright_Row.png"
  },
  {
    "name": "Kettlebell Farmers Carry",
    "targetMuscles": [
      "Grip",
      "Traps",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Grip, Traps, Core, performing a controlled Kettlebell Farmers Carry. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Farmers_Carry.png"
  },
  {
    "name": "Kettlebell Suitcase Carry",
    "targetMuscles": [
      "Obliques",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Grip, performing a controlled Kettlebell Suitcase Carry. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Suitcase_Carry.png"
  },
  {
    "name": "Kettlebell Waiter's Walk",
    "targetMuscles": [
      "Shoulder Stability",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulder Stability, Core, performing a controlled Kettlebell Waiter's Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Waiter_s_Walk.png"
  },
  {
    "name": "Kettlebell Rack Carry",
    "targetMuscles": [
      "Core",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Upper Back, performing a controlled Kettlebell Rack Carry. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Rack_Carry.png"
  },
  {
    "name": "Overhead Kettlebell Walk",
    "targetMuscles": [
      "Shoulder Stability",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulder Stability, Core, performing a controlled Overhead Kettlebell Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Overhead_Kettlebell_Walk.png"
  },
  {
    "name": "Kettlebell Lunge (Forward)",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Kettlebell Lunge (Forward). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Lunge__Forward_.png"
  },
  {
    "name": "Kettlebell Lunge (Reverse)",
    "targetMuscles": [
      "Glutes",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, performing a controlled Kettlebell Lunge (Reverse). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Lunge__Reverse_.png"
  },
  {
    "name": "Kettlebell Walking Lunge",
    "targetMuscles": [
      "Legs",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Cardio, performing a controlled Kettlebell Walking Lunge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Walking_Lunge.png"
  },
  {
    "name": "Kettlebell Side Lunge (Cossack)",
    "targetMuscles": [
      "Adductors",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors, Glutes, performing a controlled Kettlebell Side Lunge (Cossack). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Side_Lunge__Cossack_.png"
  },
  {
    "name": "Kettlebell Curtsy Lunge",
    "targetMuscles": [
      "Glutes (Medius)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), performing a controlled Kettlebell Curtsy Lunge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Curtsy_Lunge.png"
  },
  {
    "name": "Kettlebell Step-Up",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Kettlebell Step-Up. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Step_Up.png"
  },
  {
    "name": "Kettlebell Pistol Squat",
    "targetMuscles": [
      "Quadriceps",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Balance, performing a controlled Kettlebell Pistol Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Pistol_Squat.png"
  },
  {
    "name": "Kettlebell Sots Press",
    "targetMuscles": [
      "Shoulders",
      "Mobility"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Mobility, performing a controlled Kettlebell Sots Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Sots_Press.png"
  },
  {
    "name": "Bottoms-Up Kettlebell Press",
    "targetMuscles": [
      "Grip",
      "Shoulder Stability"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Grip, Shoulder Stability, performing a controlled Bottoms-Up Kettlebell Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bottoms_Up_Kettlebell_Press.png"
  },
  {
    "name": "Bottoms-Up Kettlebell Carry",
    "targetMuscles": [
      "Grip",
      "Forearms"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Grip, Forearms, performing a controlled Bottoms-Up Kettlebell Carry. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bottoms_Up_Kettlebell_Carry.png"
  },
  {
    "name": "Kettlebell T-Bar Row",
    "targetMuscles": [
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, performing a controlled Kettlebell T-Bar Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_T_Bar_Row.png"
  },
  {
    "name": "Kettlebell Pullover",
    "targetMuscles": [
      "Lats",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Chest, performing a controlled Kettlebell Pullover. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Pullover.png"
  },
  {
    "name": "Kettlebell Skull Crusher",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Kettlebell Skull Crusher. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Skull_Crusher.png"
  },
  {
    "name": "Kettlebell Bicep Curl",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Kettlebell Bicep Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Bicep_Curl.png"
  },
  {
    "name": "Kettlebell Hammer Curl",
    "targetMuscles": [
      "Biceps",
      "Forearms"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, Forearms, performing a controlled Kettlebell Hammer Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Hammer_Curl.png"
  },
  {
    "name": "Kettlebell Tricep Extension (Standing)",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Kettlebell Tricep Extension (Standing). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Tricep_Extension__Standing_.png"
  },
  {
    "name": "Kettlebell Russian Twist",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Kettlebell Russian Twist. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Russian_Twist.png"
  },
  {
    "name": "Kettlebell Sit-Up",
    "targetMuscles": [
      "Abs",
      "Hip Flexors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Abs, Hip Flexors, performing a controlled Kettlebell Sit-Up. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Sit_Up.png"
  },
  {
    "name": "Kettlebell Side Bend",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Kettlebell Side Bend. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Side_Bend.png"
  },
  {
    "name": "Kettlebell Toe Touch (Lying)",
    "targetMuscles": [
      "Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Abs, performing a controlled Kettlebell Toe Touch (Lying). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Toe_Touch__Lying_.png"
  },
  {
    "name": "Kettlebell Flutter Kicks",
    "targetMuscles": [
      "Lower Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Abs, performing a controlled Kettlebell Flutter Kicks. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Flutter_Kicks.png"
  },
  {
    "name": "Kettlebell V-Up",
    "targetMuscles": [
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, performing a controlled Kettlebell V-Up. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_V_Up.png"
  },
  {
    "name": "Kettlebell Plank Pull-Through",
    "targetMuscles": [
      "Core (Anti-Rotation)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Anti-Rotation), performing a controlled Kettlebell Plank Pull-Through. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Plank_Pull_Through.png"
  },
  {
    "name": "Kettlebell Dead Bug",
    "targetMuscles": [
      "Core",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Coordination, performing a controlled Kettlebell Dead Bug. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Dead_Bug.png"
  },
  {
    "name": "Kettlebell Glute Bridge",
    "targetMuscles": [
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, performing a controlled Kettlebell Glute Bridge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Glute_Bridge.png"
  },
  {
    "name": "Kettlebell Single-Leg Glute Bridge",
    "targetMuscles": [
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, performing a controlled Kettlebell Single-Leg Glute Bridge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Single_Leg_Glute_Bridge.png"
  },
  {
    "name": "Kettlebell Calf Raise",
    "targetMuscles": [
      "Calves"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, performing a controlled Kettlebell Calf Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Calf_Raise.png"
  },
  {
    "name": "Kettlebell Shrugs",
    "targetMuscles": [
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Traps, performing a controlled Kettlebell Shrugs. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Shrugs.png"
  },
  {
    "name": "Double Kettlebell Swing",
    "targetMuscles": [
      "Glutes",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Power, performing a controlled Double Kettlebell Swing. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Swing.png"
  },
  {
    "name": "Double Kettlebell Clean",
    "targetMuscles": [
      "Hips",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Traps, performing a controlled Double Kettlebell Clean. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Clean.png"
  },
  {
    "name": "Double Kettlebell Snatch",
    "targetMuscles": [
      "Full Body",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Power, performing a controlled Double Kettlebell Snatch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Snatch.png"
  },
  {
    "name": "Double Kettlebell Front Squat",
    "targetMuscles": [
      "Quadriceps",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Core, performing a controlled Double Kettlebell Front Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Front_Squat.png"
  },
  {
    "name": "Double Kettlebell Press",
    "targetMuscles": [
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, performing a controlled Double Kettlebell Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Press.png"
  },
  {
    "name": "Double Kettlebell Thruster",
    "targetMuscles": [
      "Full Body",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Cardio, performing a controlled Double Kettlebell Thruster. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Thruster.png"
  },
  {
    "name": "Double Kettlebell Deadlift",
    "targetMuscles": [
      "Glutes",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, performing a controlled Double Kettlebell Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Deadlift.png"
  },
  {
    "name": "Double Kettlebell Farmers Walk",
    "targetMuscles": [
      "Grip",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Grip, Traps, performing a controlled Double Kettlebell Farmers Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Farmers_Walk.png"
  },
  {
    "name": "Double Kettlebell Rack Walk",
    "targetMuscles": [
      "Core",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Upper Back, performing a controlled Double Kettlebell Rack Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Rack_Walk.png"
  },
  {
    "name": "Double Kettlebell Overhead Walk",
    "targetMuscles": [
      "Shoulders",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, performing a controlled Double Kettlebell Overhead Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Overhead_Walk.png"
  },
  {
    "name": "Double Kettlebell Renegade Row",
    "targetMuscles": [
      "Back",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Back, Core, performing a controlled Double Kettlebell Renegade Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Renegade_Row.png"
  },
  {
    "name": "Double Kettlebell Lunge",
    "targetMuscles": [
      "Legs",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Core, performing a controlled Double Kettlebell Lunge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Lunge.png"
  },
  {
    "name": "Double Kettlebell Floor Press",
    "targetMuscles": [
      "Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Triceps, performing a controlled Double Kettlebell Floor Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Double_Kettlebell_Floor_Press.png"
  },
  {
    "name": "Kettlebell Deck Squat",
    "targetMuscles": [
      "Mobility",
      "Legs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Mobility, Legs, performing a controlled Kettlebell Deck Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Deck_Squat.png"
  },
  {
    "name": "Kettlebell Tactical Lunge",
    "targetMuscles": [
      "Legs",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Coordination, performing a controlled Kettlebell Tactical Lunge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Tactical_Lunge.png"
  },
  {
    "name": "Kettlebell Uppercut",
    "targetMuscles": [
      "Shoulders",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, performing a controlled Kettlebell Uppercut. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Uppercut.png"
  },
  {
    "name": "Kettlebell Woodchopper",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Kettlebell Woodchopper. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Woodchopper.png"
  },
  {
    "name": "Kettlebell Ribbon",
    "targetMuscles": [
      "Shoulders",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, performing a controlled Kettlebell Ribbon. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Ribbon.png"
  },
  {
    "name": "Kettlebell Good Morning",
    "targetMuscles": [
      "Hamstrings",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Lower Back, performing a controlled Kettlebell Good Morning. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Good_Morning.png"
  },
  {
    "name": "Kettlebell Kang Squat",
    "targetMuscles": [
      "Hamstrings",
      "Quads"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Quads, performing a controlled Kettlebell Kang Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Kang_Squat.png"
  },
  {
    "name": "Kettlebell Z-Press",
    "targetMuscles": [
      "Shoulders",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, performing a controlled Kettlebell Z-Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Z_Press.png"
  },
  {
    "name": "Kettlebell Bear Crawl",
    "targetMuscles": [
      "Full Body",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Core, performing a controlled Kettlebell Bear Crawl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Bear_Crawl.png"
  },
  {
    "name": "Kettlebell Man Maker",
    "targetMuscles": [
      "Full Body",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Cardio, performing a controlled Kettlebell Man Maker. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Man_Maker.png"
  },
  {
    "name": "Kettlebell See-Saw Press",
    "targetMuscles": [
      "Shoulders",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, performing a controlled Kettlebell See-Saw Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_See_Saw_Press.png"
  },
  {
    "name": "Kettlebell Lateral Raise",
    "targetMuscles": [
      "Side Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, performing a controlled Kettlebell Lateral Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Lateral_Raise.png"
  },
  {
    "name": "Kettlebell Front Raise",
    "targetMuscles": [
      "Front Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Front Delts, performing a controlled Kettlebell Front Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Front_Raise.png"
  },
  {
    "name": "Kettlebell Leg Over (Core)",
    "targetMuscles": [
      "Abs",
      "Hip Flexors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Abs, Hip Flexors, performing a controlled Kettlebell Leg Over (Core). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Leg_Over__Core_.png"
  },
  {
    "name": "Kettlebell Twist and Press",
    "targetMuscles": [
      "Shoulders",
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Obliques, performing a controlled Kettlebell Twist and Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Twist_and_Press.png"
  },
  {
    "name": "Kettlebell Burpee",
    "targetMuscles": [
      "Full Body",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Cardio, performing a controlled Kettlebell Burpee. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Burpee.png"
  },
  {
    "name": "Kettlebell Squat to Upright Row",
    "targetMuscles": [
      "Full Body"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, performing a controlled Kettlebell Squat to Upright Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Squat_to_Upright_Row.png"
  },
  {
    "name": "Kettlebell Clean to Lunge",
    "targetMuscles": [
      "Full Body",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Coordination, performing a controlled Kettlebell Clean to Lunge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Clean_to_Lunge.png"
  },
  {
    "name": "Kettlebell Snatch to Lunge",
    "targetMuscles": [
      "Full Body",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Power, performing a controlled Kettlebell Snatch to Lunge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Snatch_to_Lunge.png"
  },
  {
    "name": "Kettlebell Rotational Swing",
    "targetMuscles": [
      "Glutes",
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Obliques, performing a controlled Kettlebell Rotational Swing. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Rotational_Swing.png"
  },
  {
    "name": "Kettlebell Pendulum",
    "targetMuscles": [
      "Obliques",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Core, performing a controlled Kettlebell Pendulum. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Pendulum.png"
  },
  {
    "name": "Kettlebell Hot Potato",
    "targetMuscles": [
      "Core",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Coordination, performing a controlled Kettlebell Hot Potato. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kettlebell_Hot_Potato.png"
  },
  {
    "name": "Downward Facing Dog",
    "targetMuscles": [
      "Hamstrings",
      "Calves",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Calves, Shoulders, performing a controlled Downward Facing Dog. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Downward_Facing_Dog.png"
  },
  {
    "name": "Upward Facing Dog",
    "targetMuscles": [
      "Lower Back",
      "Abs",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Abs, Chest, performing a controlled Upward Facing Dog. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Upward_Facing_Dog.png"
  },
  {
    "name": "Cat-Cow Stretch",
    "targetMuscles": [
      "Spine",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Spine, Core, performing a controlled Cat-Cow Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cat_Cow_Stretch.png"
  },
  {
    "name": "Child's Pose",
    "targetMuscles": [
      "Lower Back",
      "Hips",
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Hips, Lats, performing a controlled Child's Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Child_s_Pose.png"
  },
  {
    "name": "Cobra Pose",
    "targetMuscles": [
      "Lower Back",
      "Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Abs, performing a controlled Cobra Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cobra_Pose.png"
  },
  {
    "name": "Pigeon Pose",
    "targetMuscles": [
      "Glutes",
      "Hips (External Rotators)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hips (External Rotators), performing a controlled Pigeon Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Pigeon_Pose.png"
  },
  {
    "name": "Warrior I",
    "targetMuscles": [
      "Quadriceps",
      "Hips",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Hips, Shoulders, performing a controlled Warrior I. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Warrior_I.png"
  },
  {
    "name": "Warrior II",
    "targetMuscles": [
      "Hips",
      "Groin",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Groin, Shoulders, performing a controlled Warrior II. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Warrior_II.png"
  },
  {
    "name": "Warrior III",
    "targetMuscles": [
      "Glutes",
      "Hamstrings",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, Balance, performing a controlled Warrior III. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Warrior_III.png"
  },
  {
    "name": "Triangle Pose (Trikonasana)",
    "targetMuscles": [
      "Hamstrings",
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Obliques, performing a controlled Triangle Pose (Trikonasana). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Triangle_Pose__Trikonasana_.png"
  },
  {
    "name": "Extended Side Angle Pose",
    "targetMuscles": [
      "Obliques",
      "Legs",
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Legs, Lats, performing a controlled Extended Side Angle Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Extended_Side_Angle_Pose.png"
  },
  {
    "name": "Tree Pose",
    "targetMuscles": [
      "Balance",
      "Calves",
      "Ankles"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Balance, Calves, Ankles, performing a controlled Tree Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Tree_Pose.png"
  },
  {
    "name": "Eagle Pose",
    "targetMuscles": [
      "Shoulders",
      "Upper Back",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Upper Back, Hips, performing a controlled Eagle Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Eagle_Pose.png"
  },
  {
    "name": "Chair Pose (Utkatasana)",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Chair Pose (Utkatasana). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Chair_Pose__Utkatasana_.png"
  },
  {
    "name": "Bridge Pose",
    "targetMuscles": [
      "Glutes",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Lower Back, performing a controlled Bridge Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bridge_Pose.png"
  },
  {
    "name": "Wheel Pose (Full Backbend)",
    "targetMuscles": [
      "Spine",
      "Chest",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Spine, Chest, Shoulders, performing a controlled Wheel Pose (Full Backbend). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wheel_Pose__Full_Backbend_.png"
  },
  {
    "name": "Seated Forward Fold",
    "targetMuscles": [
      "Hamstrings",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Lower Back, performing a controlled Seated Forward Fold. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Forward_Fold.png"
  },
  {
    "name": "Standing Forward Fold",
    "targetMuscles": [
      "Hamstrings",
      "Calves"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Calves, performing a controlled Standing Forward Fold. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Standing_Forward_Fold.png"
  },
  {
    "name": "Butterfly Stretch",
    "targetMuscles": [
      "Adductors (Inner Thigh)",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors (Inner Thigh), Hips, performing a controlled Butterfly Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Butterfly_Stretch.png"
  },
  {
    "name": "Happy Baby Pose",
    "targetMuscles": [
      "Hips",
      "Groin"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Groin, performing a controlled Happy Baby Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Happy_Baby_Pose.png"
  },
  {
    "name": "Sphinx Pose",
    "targetMuscles": [
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, performing a controlled Sphinx Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sphinx_Pose.png"
  },
  {
    "name": "Puppy Pose",
    "targetMuscles": [
      "Shoulders",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Upper Back, performing a controlled Puppy Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Puppy_Pose.png"
  },
  {
    "name": "Thread the Needle",
    "targetMuscles": [
      "Upper Back",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back, Shoulders, performing a controlled Thread the Needle. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Thread_the_Needle.png"
  },
  {
    "name": "World's Greatest Stretch",
    "targetMuscles": [
      "Hips",
      "Thoracic Spine",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Thoracic Spine, Hamstrings, performing a controlled World's Greatest Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/World_s_Greatest_Stretch.png"
  },
  {
    "name": "90/90 Hip Stretch",
    "targetMuscles": [
      "Hips (Internal/External Rotation)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips (Internal/External Rotation), performing a controlled 90/90 Hip Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/90_90_Hip_Stretch.png"
  },
  {
    "name": "Couch Stretch",
    "targetMuscles": [
      "Hip Flexors",
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hip Flexors, Quadriceps, performing a controlled Couch Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Couch_Stretch.png"
  },
  {
    "name": "Lizard Pose",
    "targetMuscles": [
      "Hip Flexors",
      "Groin"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hip Flexors, Groin, performing a controlled Lizard Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lizard_Pose.png"
  },
  {
    "name": "Frog Pose",
    "targetMuscles": [
      "Adductors (Inner Thigh)",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors (Inner Thigh), Hips, performing a controlled Frog Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Frog_Pose.png"
  },
  {
    "name": "Garland Pose (Yogi Squat)",
    "targetMuscles": [
      "Hips",
      "Ankles",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Ankles, Lower Back, performing a controlled Garland Pose (Yogi Squat). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Garland_Pose__Yogi_Squat_.png"
  },
  {
    "name": "Half Split (Hanumanasana Prep)",
    "targetMuscles": [
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, performing a controlled Half Split (Hanumanasana Prep). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Half_Split__Hanumanasana_Prep_.png"
  },
  {
    "name": "Full Split (Hanumanasana)",
    "targetMuscles": [
      "Hamstrings",
      "Hip Flexors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Hip Flexors, performing a controlled Full Split (Hanumanasana). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Full_Split__Hanumanasana_.png"
  },
  {
    "name": "Low Lunge",
    "targetMuscles": [
      "Hip Flexors",
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hip Flexors, Quadriceps, performing a controlled Low Lunge. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Low_Lunge.png"
  },
  {
    "name": "High Lunge (Crescent Lunge)",
    "targetMuscles": [
      "Hip Flexors",
      "Legs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hip Flexors, Legs, performing a controlled High Lunge (Crescent Lunge). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/High_Lunge__Crescent_Lunge_.png"
  },
  {
    "name": "Gate Pose",
    "targetMuscles": [
      "Side Body",
      "Adductors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Body, Adductors, performing a controlled Gate Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Gate_Pose.png"
  },
  {
    "name": "Camel Pose",
    "targetMuscles": [
      "Quads",
      "Abs",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quads, Abs, Chest, performing a controlled Camel Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Camel_Pose.png"
  },
  {
    "name": "Bow Pose",
    "targetMuscles": [
      "Back",
      "Chest",
      "Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Back, Chest, Abs, performing a controlled Bow Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bow_Pose.png"
  },
  {
    "name": "Boat Pose",
    "targetMuscles": [
      "Core (Abs)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Abs), performing a controlled Boat Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Boat_Pose.png"
  },
  {
    "name": "Crow Pose",
    "targetMuscles": [
      "Arms",
      "Core",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Arms, Core, Balance, performing a controlled Crow Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Crow_Pose.png"
  },
  {
    "name": "Side Plank (Vasisthasana)",
    "targetMuscles": [
      "Obliques",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Shoulders, performing a controlled Side Plank (Vasisthasana). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Side_Plank__Vasisthasana_.png"
  },
  {
    "name": "Reverse Plank",
    "targetMuscles": [
      "Glutes",
      "Hamstrings",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hamstrings, Shoulders, performing a controlled Reverse Plank. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Reverse_Plank.png"
  },
  {
    "name": "Fish Pose",
    "targetMuscles": [
      "Chest",
      "Neck",
      "Throat"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Neck, Throat, performing a controlled Fish Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Fish_Pose.png"
  },
  {
    "name": "Plow Pose",
    "targetMuscles": [
      "Upper Back",
      "Neck"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back, Neck, performing a controlled Plow Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Plow_Pose.png"
  },
  {
    "name": "Shoulder Stand",
    "targetMuscles": [
      "Shoulders",
      "Neck",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Neck, Core, performing a controlled Shoulder Stand. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Shoulder_Stand.png"
  },
  {
    "name": "Headstand",
    "targetMuscles": [
      "Core",
      "Shoulders",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Shoulders, Balance, performing a controlled Headstand. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Headstand.png"
  },
  {
    "name": "Handstand",
    "targetMuscles": [
      "Shoulders",
      "Core",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, Balance, performing a controlled Handstand. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Handstand.png"
  },
  {
    "name": "Scorpion Pose",
    "targetMuscles": [
      "Back",
      "Core",
      "Flexibility"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Back, Core, Flexibility, performing a controlled Scorpion Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Scorpion_Pose.png"
  },
  {
    "name": "Wild Thing",
    "targetMuscles": [
      "Chest",
      "Shoulders",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Shoulders, Hips, performing a controlled Wild Thing. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wild_Thing.png"
  },
  {
    "name": "Dancer's Pose",
    "targetMuscles": [
      "Quads",
      "Balance",
      "Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quads, Balance, Chest, performing a controlled Dancer's Pose. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dancer_s_Pose.png"
  },
  {
    "name": "Standing Quad Stretch",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Standing Quad Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Standing_Quad_Stretch.png"
  },
  {
    "name": "Lying Quad Stretch",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Lying Quad Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lying_Quad_Stretch.png"
  },
  {
    "name": "Figure 4 Stretch (Lying)",
    "targetMuscles": [
      "Glutes",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hips, performing a controlled Figure 4 Stretch (Lying). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Figure_4_Stretch__Lying_.png"
  },
  {
    "name": "Figure 4 Stretch (Standing)",
    "targetMuscles": [
      "Glutes",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Balance, performing a controlled Figure 4 Stretch (Standing). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Figure_4_Stretch__Standing_.png"
  },
  {
    "name": "Knee-to-Chest Stretch",
    "targetMuscles": [
      "Lower Back",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Glutes, performing a controlled Knee-to-Chest Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Knee_to_Chest_Stretch.png"
  },
  {
    "name": "Spinal Twist (Supine)",
    "targetMuscles": [
      "Lower Back",
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Obliques, performing a controlled Spinal Twist (Supine). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Spinal_Twist__Supine_.png"
  },
  {
    "name": "Seated Spinal Twist",
    "targetMuscles": [
      "Spine",
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Spine, Obliques, performing a controlled Seated Spinal Twist. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Seated_Spinal_Twist.png"
  },
  {
    "name": "Neck Rolls",
    "targetMuscles": [
      "Neck (Traps)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Neck (Traps), performing a controlled Neck Rolls. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Neck_Rolls.png"
  },
  {
    "name": "Neck Side Bend",
    "targetMuscles": [
      "Neck (Scalenes)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Neck (Scalenes), performing a controlled Neck Side Bend. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Neck_Side_Bend.png"
  },
  {
    "name": "Wrist Flexor Stretch",
    "targetMuscles": [
      "Forearms (Flexors)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms (Flexors), performing a controlled Wrist Flexor Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wrist_Flexor_Stretch.png"
  },
  {
    "name": "Wrist Extensor Stretch",
    "targetMuscles": [
      "Forearms (Extensors)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms (Extensors), performing a controlled Wrist Extensor Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wrist_Extensor_Stretch.png"
  },
  {
    "name": "Shoulder Cross-Body Stretch",
    "targetMuscles": [
      "Rear Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, performing a controlled Shoulder Cross-Body Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Shoulder_Cross_Body_Stretch.png"
  },
  {
    "name": "Triceps Overhead Stretch",
    "targetMuscles": [
      "Triceps",
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, Lats, performing a controlled Triceps Overhead Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Triceps_Overhead_Stretch.png"
  },
  {
    "name": "Chest Doorway Stretch",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Chest Doorway Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Chest_Doorway_Stretch.png"
  },
  {
    "name": "Wall Angels",
    "targetMuscles": [
      "Upper Back",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back, Shoulders, performing a controlled Wall Angels. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wall_Angels.png"
  },
  {
    "name": "Scapular Wall Slides",
    "targetMuscles": [
      "Serratus Anterior",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Serratus Anterior, Shoulders, performing a controlled Scapular Wall Slides. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Scapular_Wall_Slides.png"
  },
  {
    "name": "Thoracic Extension (Foam Roller)",
    "targetMuscles": [
      "Upper Back (Thoracic Spine)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back (Thoracic Spine), performing a controlled Thoracic Extension (Foam Roller). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Thoracic_Extension__Foam_Roller_.png"
  },
  {
    "name": "Lat Stretch (Child's Pose Var)",
    "targetMuscles": [
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, performing a controlled Lat Stretch (Child's Pose Var). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lat_Stretch__Child_s_Pose_Var_.png"
  },
  {
    "name": "IT Band Stretch (Standing)",
    "targetMuscles": [
      "IT Band",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the IT Band, Hips, performing a controlled IT Band Stretch (Standing). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/IT_Band_Stretch__Standing_.png"
  },
  {
    "name": "Calf Stretch (Wall)",
    "targetMuscles": [
      "Calves (Gastrocnemius)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves (Gastrocnemius), performing a controlled Calf Stretch (Wall). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Calf_Stretch__Wall_.png"
  },
  {
    "name": "Soleus Stretch (Wall)",
    "targetMuscles": [
      "Calves (Soleus)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves (Soleus), performing a controlled Soleus Stretch (Wall). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Soleus_Stretch__Wall_.png"
  },
  {
    "name": "Ankle Dorsiflexion Drill",
    "targetMuscles": [
      "Ankles"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Ankles, performing a controlled Ankle Dorsiflexion Drill. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Ankle_Dorsiflexion_Drill.png"
  },
  {
    "name": "Toe Sit (Plantar Fascia)",
    "targetMuscles": [
      "Feet",
      "Toes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Feet, Toes, performing a controlled Toe Sit (Plantar Fascia). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Toe_Sit__Plantar_Fascia_.png"
  },
  {
    "name": "Deep Squat Hold",
    "targetMuscles": [
      "Hips",
      "Ankles"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Ankles, performing a controlled Deep Squat Hold. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Deep_Squat_Hold.png"
  },
  {
    "name": "Cossack Squat Hold",
    "targetMuscles": [
      "Adductors",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors, Hamstrings, performing a controlled Cossack Squat Hold. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cossack_Squat_Hold.png"
  },
  {
    "name": "Pancake Stretch",
    "targetMuscles": [
      "Adductors",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors, Hamstrings, performing a controlled Pancake Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Pancake_Stretch.png"
  },
  {
    "name": "Middle Split Hold",
    "targetMuscles": [
      "Adductors",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors, Hips, performing a controlled Middle Split Hold. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Middle_Split_Hold.png"
  },
  {
    "name": "Jefferson Curl",
    "targetMuscles": [
      "Spine",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Spine, Hamstrings, performing a controlled Jefferson Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Jefferson_Curl.png"
  },
  {
    "name": "Banded Shoulder Dislocates",
    "targetMuscles": [
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, performing a controlled Banded Shoulder Dislocates. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Shoulder_Dislocates.png"
  },
  {
    "name": "Banded Pull-Aparts",
    "targetMuscles": [
      "Rear Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, performing a controlled Banded Pull-Aparts. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Pull_Aparts.png"
  },
  {
    "name": "Dead Hang",
    "targetMuscles": [
      "Spine",
      "Lats",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Spine, Lats, Grip, performing a controlled Dead Hang. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dead_Hang.png"
  },
  {
    "name": "Scapular Pull-Ups",
    "targetMuscles": [
      "Lats",
      "Lower Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Lower Traps, performing a controlled Scapular Pull-Ups. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Scapular_Pull_Ups.png"
  },
  {
    "name": "Hip Airplanes",
    "targetMuscles": [
      "Glutes",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hips, performing a controlled Hip Airplanes. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hip_Airplanes.png"
  },
  {
    "name": "Clamshells",
    "targetMuscles": [
      "Glutes (Medius)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), performing a controlled Clamshells. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Clamshells.png"
  },
  {
    "name": "Fire Hydrants",
    "targetMuscles": [
      "Glutes",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hips, performing a controlled Fire Hydrants. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Fire_Hydrants.png"
  },
  {
    "name": "Bird Dog",
    "targetMuscles": [
      "Core",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Lower Back, performing a controlled Bird Dog. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bird_Dog.png"
  },
  {
    "name": "Dead Bug (Mobility Focus)",
    "targetMuscles": [
      "Core",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Coordination, performing a controlled Dead Bug (Mobility Focus). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Dead_Bug__Mobility_Focus_.png"
  },
  {
    "name": "Bear Sit",
    "targetMuscles": [
      "Hips (Internal Rotation)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips (Internal Rotation), performing a controlled Bear Sit. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bear_Sit.png"
  },
  {
    "name": "Shin Box Switch",
    "targetMuscles": [
      "Hips (Mobility)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips (Mobility), performing a controlled Shin Box Switch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Shin_Box_Switch.png"
  },
  {
    "name": "Inchworm",
    "targetMuscles": [
      "Hamstrings",
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Shoulders, performing a controlled Inchworm. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Inchworm.png"
  },
  {
    "name": "Spiderman Lunge with Twist",
    "targetMuscles": [
      "Hips",
      "Thoracic Spine"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Thoracic Spine, performing a controlled Spiderman Lunge with Twist. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Spiderman_Lunge_with_Twist.png"
  },
  {
    "name": "Thoracic Rotation (Quadruped)",
    "targetMuscles": [
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back, performing a controlled Thoracic Rotation (Quadruped). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Thoracic_Rotation__Quadruped_.png"
  },
  {
    "name": "Scorpion Stretch (Prone)",
    "targetMuscles": [
      "Chest",
      "Shoulders",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Shoulders, Hips, performing a controlled Scorpion Stretch (Prone). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Scorpion_Stretch__Prone_.png"
  },
  {
    "name": "Iron Cross Stretch",
    "targetMuscles": [
      "Lower Back",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Glutes, performing a controlled Iron Cross Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Iron_Cross_Stretch.png"
  },
  {
    "name": "Bretzel Stretch",
    "targetMuscles": [
      "Quads",
      "T-Spine",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quads, T-Spine, Glutes, performing a controlled Bretzel Stretch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bretzel_Stretch.png"
  },
  {
    "name": "QL Stretch (Quadratus Lumborum)",
    "targetMuscles": [
      "Lower Back (Side)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back (Side), performing a controlled QL Stretch (Quadratus Lumborum). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/QL_Stretch__Quadratus_Lumborum_.png"
  },
  {
    "name": "Hip Flexor Mobilization",
    "targetMuscles": [
      "Hip Flexors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hip Flexors, performing a controlled Hip Flexor Mobilization. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hip_Flexor_Mobilization.png"
  },
  {
    "name": "Adductor Rockbacks",
    "targetMuscles": [
      "Adductors (Inner Thigh)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Adductors (Inner Thigh), performing a controlled Adductor Rockbacks. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Adductor_Rockbacks.png"
  },
  {
    "name": "Ankle Circles",
    "targetMuscles": [
      "Ankles"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Ankles, performing a controlled Ankle Circles. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Ankle_Circles.png"
  },
  {
    "name": "Wrist Circles",
    "targetMuscles": [
      "Wrists"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Wrists, performing a controlled Wrist Circles. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wrist_Circles.png"
  },
  {
    "name": "Sun Salutation A",
    "targetMuscles": [
      "Full Body Flow"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body Flow, performing a controlled Sun Salutation A. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sun_Salutation_A.png"
  },
  {
    "name": "Sun Salutation B",
    "targetMuscles": [
      "Full Body Flow"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body Flow, performing a controlled Sun Salutation B. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sun_Salutation_B.png"
  },
  {
    "name": "Jumping Jacks",
    "targetMuscles": [
      "Full Body",
      "Calves",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Calves, Cardio, performing a controlled Jumping Jacks. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Jumping_Jacks.png"
  },
  {
    "name": "High Knees (Running in Place)",
    "targetMuscles": [
      "Hip Flexors",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hip Flexors, Cardio, performing a controlled High Knees (Running in Place). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/High_Knees__Running_in_Place_.png"
  },
  {
    "name": "Butt Kicks",
    "targetMuscles": [
      "Hamstrings",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Cardio, performing a controlled Butt Kicks. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Butt_Kicks.png"
  },
  {
    "name": "Skater Jumps (Side-to-Side)",
    "targetMuscles": [
      "Glutes (Medius)",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), Cardio, performing a controlled Skater Jumps (Side-to-Side). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Skater_Jumps__Side_to_Side_.png"
  },
  {
    "name": "Star Jumps",
    "targetMuscles": [
      "Full Body",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Power, performing a controlled Star Jumps. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Star_Jumps.png"
  },
  {
    "name": "Tuck Jumps",
    "targetMuscles": [
      "Core",
      "Legs",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Legs, Power, performing a controlled Tuck Jumps. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Tuck_Jumps.png"
  },
  {
    "name": "180 Jump Squats",
    "targetMuscles": [
      "Quadriceps",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Cardio, performing a controlled 180 Jump Squats. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/180_Jump_Squats.png"
  },
  {
    "name": "Split Squat Jumps (Plyo Lunge)",
    "targetMuscles": [
      "Quadriceps",
      "Glutes",
      "Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, Power, performing a controlled Split Squat Jumps (Plyo Lunge). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Split_Squat_Jumps__Plyo_Lunge_.png"
  },
  {
    "name": "Depth Jumps",
    "targetMuscles": [
      "Legs",
      "Reactive Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Reactive Power, performing a controlled Depth Jumps. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Depth_Jumps.png"
  },
  {
    "name": "Single-Leg Box Jump",
    "targetMuscles": [
      "Unilateral Power",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Unilateral Power, Glutes, performing a controlled Single-Leg Box Jump. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Single_Leg_Box_Jump.png"
  },
  {
    "name": "Lateral Box Jump",
    "targetMuscles": [
      "Glutes (Medius)",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), Cardio, performing a controlled Lateral Box Jump. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lateral_Box_Jump.png"
  },
  {
    "name": "Hurdle Hops",
    "targetMuscles": [
      "Legs",
      "Athleticism"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Athleticism, performing a controlled Hurdle Hops. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hurdle_Hops.png"
  },
  {
    "name": "Agility Ladder (In-Out)",
    "targetMuscles": [
      "Calves",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, Coordination, performing a controlled Agility Ladder (In-Out). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Agility_Ladder__In_Out_.png"
  },
  {
    "name": "Agility Ladder (Ickey Shuffle)",
    "targetMuscles": [
      "Calves",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, Coordination, performing a controlled Agility Ladder (Ickey Shuffle). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Agility_Ladder__Ickey_Shuffle_.png"
  },
  {
    "name": "SkiErg (Double Pole)",
    "targetMuscles": [
      "Lats",
      "Triceps",
      "Core",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Triceps, Core, Cardio, performing a controlled SkiErg (Double Pole). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/SkiErg__Double_Pole_.png"
  },
  {
    "name": "VersaClimber",
    "targetMuscles": [
      "Full Body",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Cardio, performing a controlled VersaClimber. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/VersaClimber.png"
  },
  {
    "name": "Recumbent Bike",
    "targetMuscles": [
      "Quadriceps",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Cardio, performing a controlled Recumbent Bike. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Recumbent_Bike.png"
  },
  {
    "name": "Spin Bike (Standing Climb)",
    "targetMuscles": [
      "Quads",
      "Glutes",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quads, Glutes, Cardio, performing a controlled Spin Bike (Standing Climb). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Spin_Bike__Standing_Climb_.png"
  },
  {
    "name": "Curved Treadmill Sprint",
    "targetMuscles": [
      "Hamstrings",
      "Glutes",
      "Speed"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Glutes, Speed, performing a controlled Curved Treadmill Sprint. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Curved_Treadmill_Sprint.png"
  },
  {
    "name": "Heavy Bag Boxing (Jab/Cross)",
    "targetMuscles": [
      "Shoulders",
      "Core",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, Cardio, performing a controlled Heavy Bag Boxing (Jab/Cross). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Heavy_Bag_Boxing__Jab_Cross_.png"
  },
  {
    "name": "Speed Bag",
    "targetMuscles": [
      "Shoulders",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Coordination, performing a controlled Speed Bag. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Speed_Bag.png"
  },
  {
    "name": "Jump Rope (Crossover)",
    "targetMuscles": [
      "Calves",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, Coordination, performing a controlled Jump Rope (Crossover). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Jump_Rope__Crossover_.png"
  },
  {
    "name": "Jump Rope (High Knees)",
    "targetMuscles": [
      "Calves",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves, Cardio, performing a controlled Jump Rope (High Knees). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Jump_Rope__High_Knees_.png"
  },
  {
    "name": "Bear Crawl (Agility)",
    "targetMuscles": [
      "Shoulders",
      "Core",
      "Quads"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Core, Quads, performing a controlled Bear Crawl (Agility). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bear_Crawl__Agility_.png"
  },
  {
    "name": "Crab Walk",
    "targetMuscles": [
      "Triceps",
      "Glutes",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, Glutes, Hamstrings, performing a controlled Crab Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Crab_Walk.png"
  },
  {
    "name": "Duck Walk",
    "targetMuscles": [
      "Quadriceps",
      "Hip Mobility"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Hip Mobility, performing a controlled Duck Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Duck_Walk.png"
  },
  {
    "name": "Inchworm to Push-Up (Speed)",
    "targetMuscles": [
      "Core",
      "Shoulders",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core, Shoulders, Hamstrings, performing a controlled Inchworm to Push-Up (Speed). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Inchworm_to_Push_Up__Speed_.png"
  },
  {
    "name": "Lateral Shuffles",
    "targetMuscles": [
      "Glutes (Medius)",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), Cardio, performing a controlled Lateral Shuffles. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Lateral_Shuffles.png"
  },
  {
    "name": "Carioca Drill",
    "targetMuscles": [
      "Hips",
      "Coordination"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hips, Coordination, performing a controlled Carioca Drill. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Carioca_Drill.png"
  },
  {
    "name": "Suicide Sprints",
    "targetMuscles": [
      "Legs",
      "Cardio",
      "Agility"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Legs, Cardio, Agility, performing a controlled Suicide Sprints. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Suicide_Sprints.png"
  },
  {
    "name": "Banded Air Squat",
    "targetMuscles": [
      "Quadriceps",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, Glutes, performing a controlled Banded Air Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Air_Squat.png"
  },
  {
    "name": "Banded Deadlift (Conventional)",
    "targetMuscles": [
      "Hamstrings",
      "Glutes",
      "Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Glutes, Back, performing a controlled Banded Deadlift (Conventional). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Deadlift__Conventional_.png"
  },
  {
    "name": "Banded Sumo Deadlift",
    "targetMuscles": [
      "Glutes",
      "Inner Thigh"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Inner Thigh, performing a controlled Banded Sumo Deadlift. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Sumo_Deadlift.png"
  },
  {
    "name": "Banded Good Morning",
    "targetMuscles": [
      "Hamstrings",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Lower Back, performing a controlled Banded Good Morning. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Good_Morning.png"
  },
  {
    "name": "Banded Thruster",
    "targetMuscles": [
      "Shoulders",
      "Quads",
      "Cardio"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, Quads, Cardio, performing a controlled Banded Thruster. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Thruster.png"
  },
  {
    "name": "Banded Overhead Press",
    "targetMuscles": [
      "Shoulders"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shoulders, performing a controlled Banded Overhead Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Overhead_Press.png"
  },
  {
    "name": "Banded Upright Row",
    "targetMuscles": [
      "Side Delts",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, Traps, performing a controlled Banded Upright Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Upright_Row.png"
  },
  {
    "name": "Banded Bent Over Row",
    "targetMuscles": [
      "Lats",
      "Middle Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Middle Back, performing a controlled Banded Bent Over Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Bent_Over_Row.png"
  },
  {
    "name": "Banded Seated Row",
    "targetMuscles": [
      "Middle Back",
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, Lats, performing a controlled Banded Seated Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Seated_Row.png"
  },
  {
    "name": "Banded Face Pull",
    "targetMuscles": [
      "Rear Delts",
      "Rotator Cuff"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, Rotator Cuff, performing a controlled Banded Face Pull. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Face_Pull.png"
  },
  {
    "name": "Banded Pull-Apart",
    "targetMuscles": [
      "Rear Delts",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, Upper Back, performing a controlled Banded Pull-Apart. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Pull_Apart.png"
  },
  {
    "name": "Banded Lat Pulldown (Kneeling)",
    "targetMuscles": [
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, performing a controlled Banded Lat Pulldown (Kneeling). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Lat_Pulldown__Kneeling_.png"
  },
  {
    "name": "Banded Chest Press (Standing)",
    "targetMuscles": [
      "Chest",
      "Core Stability"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Core Stability, performing a controlled Banded Chest Press (Standing). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Chest_Press__Standing_.png"
  },
  {
    "name": "Banded Push-Up (Resisted)",
    "targetMuscles": [
      "Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest, Triceps, performing a controlled Banded Push-Up (Resisted). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Push_Up__Resisted_.png"
  },
  {
    "name": "Banded Chest Fly",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Banded Chest Fly. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Chest_Fly.png"
  },
  {
    "name": "Banded Tricep Pressdown",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Banded Tricep Pressdown. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Tricep_Pressdown.png"
  },
  {
    "name": "Banded Overhead Tricep Extension",
    "targetMuscles": [
      "Triceps (Long Head)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps (Long Head), performing a controlled Banded Overhead Tricep Extension. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Overhead_Tricep_Extension.png"
  },
  {
    "name": "Banded Kickback",
    "targetMuscles": [
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps, performing a controlled Banded Kickback. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Kickback.png"
  },
  {
    "name": "Banded Bicep Curl",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Banded Bicep Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Bicep_Curl.png"
  },
  {
    "name": "Banded Hammer Curl",
    "targetMuscles": [
      "Biceps",
      "Forearms"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, Forearms, performing a controlled Banded Hammer Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Hammer_Curl.png"
  },
  {
    "name": "Banded Concentration Curl",
    "targetMuscles": [
      "Biceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps, performing a controlled Banded Concentration Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Concentration_Curl.png"
  },
  {
    "name": "Banded Lateral Raise",
    "targetMuscles": [
      "Side Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Side Delts, performing a controlled Banded Lateral Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Lateral_Raise.png"
  },
  {
    "name": "Banded Front Raise",
    "targetMuscles": [
      "Front Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Front Delts, performing a controlled Banded Front Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Front_Raise.png"
  },
  {
    "name": "Banded Rear Delt Fly",
    "targetMuscles": [
      "Rear Delts"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Rear Delts, performing a controlled Banded Rear Delt Fly. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Rear_Delt_Fly.png"
  },
  {
    "name": "Banded Shrugs",
    "targetMuscles": [
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Traps, performing a controlled Banded Shrugs. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Shrugs.png"
  },
  {
    "name": "Banded Glute Kickback",
    "targetMuscles": [
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, performing a controlled Banded Glute Kickback. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Glute_Kickback.png"
  },
  {
    "name": "Banded Fire Hydrant",
    "targetMuscles": [
      "Glutes",
      "Hips"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes, Hips, performing a controlled Banded Fire Hydrant. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Fire_Hydrant.png"
  },
  {
    "name": "Banded Monster Walk",
    "targetMuscles": [
      "Glutes (Medius)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Glutes (Medius), performing a controlled Banded Monster Walk. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Monster_Walk.png"
  },
  {
    "name": "Banded Leg Curl (Prone)",
    "targetMuscles": [
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, performing a controlled Banded Leg Curl (Prone). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Leg_Curl__Prone_.png"
  },
  {
    "name": "Banded Leg Extension (Seated)",
    "targetMuscles": [
      "Quadriceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps, performing a controlled Banded Leg Extension (Seated). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Leg_Extension__Seated_.png"
  },
  {
    "name": "Banded Woodchopper",
    "targetMuscles": [
      "Obliques",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Core, performing a controlled Banded Woodchopper. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Woodchopper.png"
  },
  {
    "name": "Banded Pallof Press",
    "targetMuscles": [
      "Core (Anti-Rotation)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Core (Anti-Rotation), performing a controlled Banded Pallof Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Pallof_Press.png"
  },
  {
    "name": "Banded Russian Twist",
    "targetMuscles": [
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, performing a controlled Banded Russian Twist. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Russian_Twist.png"
  },
  {
    "name": "Banded Bicycle Crunch",
    "targetMuscles": [
      "Abs",
      "Obliques"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Abs, Obliques, performing a controlled Banded Bicycle Crunch. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Banded_Bicycle_Crunch.png"
  },
  {
    "name": "Zercher Squat",
    "targetMuscles": [
      "Quads",
      "Core",
      "Upper Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quads, Core, Upper Back, performing a controlled Zercher Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Zercher_Squat.png"
  },
  {
    "name": "Jefferson Squat",
    "targetMuscles": [
      "Quads",
      "Glutes",
      "Adductors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quads, Glutes, Adductors, performing a controlled Jefferson Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Jefferson_Squat.png"
  },
  {
    "name": "Kang Squat",
    "targetMuscles": [
      "Hamstrings",
      "Quads"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Quads, performing a controlled Kang Squat. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Kang_Squat.png"
  },
  {
    "name": "Nordic Hamstring Curl",
    "targetMuscles": [
      "Hamstrings (Eccentric)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings (Eccentric), performing a controlled Nordic Hamstring Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Nordic_Hamstring_Curl.png"
  },
  {
    "name": "Reverse Hyperextension",
    "targetMuscles": [
      "Lower Back",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Glutes, performing a controlled Reverse Hyperextension. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Reverse_Hyperextension.png"
  },
  {
    "name": "GHD Sit-Up",
    "targetMuscles": [
      "Abs",
      "Hip Flexors"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Abs, Hip Flexors, performing a controlled GHD Sit-Up. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/GHD_Sit_Up.png"
  },
  {
    "name": "GHD Back Extension",
    "targetMuscles": [
      "Lower Back",
      "Hamstrings"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Back, Hamstrings, performing a controlled GHD Back Extension. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/GHD_Back_Extension.png"
  },
  {
    "name": "Sissy Squat Machine",
    "targetMuscles": [
      "Quadriceps (Isolation)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Quadriceps (Isolation), performing a controlled Sissy Squat Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sissy_Squat_Machine.png"
  },
  {
    "name": "Donkey Calf Raise",
    "targetMuscles": [
      "Calves (Stretch Focus)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Calves (Stretch Focus), performing a controlled Donkey Calf Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Donkey_Calf_Raise.png"
  },
  {
    "name": "Tibialis Raise",
    "targetMuscles": [
      "Shins (Tibialis Anterior)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Shins (Tibialis Anterior), performing a controlled Tibialis Raise. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Tibialis_Raise.png"
  },
  {
    "name": "Landmine 180",
    "targetMuscles": [
      "Obliques",
      "Core Rotation"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Core Rotation, performing a controlled Landmine 180. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Landmine_180.png"
  },
  {
    "name": "Landmine Single-Leg RDL",
    "targetMuscles": [
      "Hamstrings",
      "Balance"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Balance, performing a controlled Landmine Single-Leg RDL. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Landmine_Single_Leg_RDL.png"
  },
  {
    "name": "Landmine Row (Meadows)",
    "targetMuscles": [
      "Lats (Stretch Focus)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats (Stretch Focus), performing a controlled Landmine Row (Meadows). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Landmine_Row__Meadows_.png"
  },
  {
    "name": "Chest Supported T-Bar Row",
    "targetMuscles": [
      "Middle Back",
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Middle Back, Lats, performing a controlled Chest Supported T-Bar Row. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Chest_Supported_T_Bar_Row.png"
  },
  {
    "name": "Sternum Chin-Up (Gironda)",
    "targetMuscles": [
      "Lats",
      "Lower Back"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Lower Back, performing a controlled Sternum Chin-Up (Gironda). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sternum_Chin_Up__Gironda_.png"
  },
  {
    "name": "Reverse Grip Bench Press",
    "targetMuscles": [
      "Upper Chest",
      "Triceps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Chest, Triceps, performing a controlled Reverse Grip Bench Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Reverse_Grip_Bench_Press.png"
  },
  {
    "name": "Hex Press (Dumbbell Squeeze)",
    "targetMuscles": [
      "Inner Chest"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Inner Chest, performing a controlled Hex Press (Dumbbell Squeeze). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Hex_Press__Dumbbell_Squeeze_.png"
  },
  {
    "name": "Cable Crossover (Mid Chest)",
    "targetMuscles": [
      "Chest (Pectorals)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Chest (Pectorals), performing a controlled Cable Crossover (Mid Chest). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Crossover__Mid_Chest_.png"
  },
  {
    "name": "Cable Iron Cross",
    "targetMuscles": [
      "Lower Chest",
      "Lats"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lower Chest, Lats, performing a controlled Cable Iron Cross. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cable_Iron_Cross.png"
  },
  {
    "name": "Cross-Body Hammer Curl",
    "targetMuscles": [
      "Brachialis",
      "Forearms"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Brachialis, Forearms, performing a controlled Cross-Body Hammer Curl. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Cross_Body_Hammer_Curl.png"
  },
  {
    "name": "Incline Cable Curl (Behind Back)",
    "targetMuscles": [
      "Biceps (Long Head Stretch)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps (Long Head Stretch), performing a controlled Incline Cable Curl (Behind Back). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Incline_Cable_Curl__Behind_Back_.png"
  },
  {
    "name": "Bayesian Curl (Cable)",
    "targetMuscles": [
      "Biceps (Long Head)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Biceps (Long Head), performing a controlled Bayesian Curl (Cable). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bayesian_Curl__Cable_.png"
  },
  {
    "name": "Rolling Tricep Extension",
    "targetMuscles": [
      "Triceps (All Heads)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps (All Heads), performing a controlled Rolling Tricep Extension. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Rolling_Tricep_Extension.png"
  },
  {
    "name": "Bodyweight Tricep Extension",
    "targetMuscles": [
      "Triceps (Long Head)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Triceps (Long Head), performing a controlled Bodyweight Tricep Extension. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bodyweight_Tricep_Extension.png"
  },
  {
    "name": "Wrist Roller (Flexion)",
    "targetMuscles": [
      "Forearms (Flexors)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms (Flexors), performing a controlled Wrist Roller (Flexion). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wrist_Roller__Flexion_.png"
  },
  {
    "name": "Wrist Roller (Extension)",
    "targetMuscles": [
      "Forearms (Extensors)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Forearms (Extensors), performing a controlled Wrist Roller (Extension). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Wrist_Roller__Extension_.png"
  },
  {
    "name": "Neck Flexion (Plate/Machine)",
    "targetMuscles": [
      "Neck (Sternocleidomastoid)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Neck (Sternocleidomastoid), performing a controlled Neck Flexion (Plate/Machine). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Neck_Flexion__Plate_Machine_.png"
  },
  {
    "name": "Neck Extension (Harness)",
    "targetMuscles": [
      "Neck (Upper Traps)"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Neck (Upper Traps), performing a controlled Neck Extension (Harness). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Neck_Extension__Harness_.png"
  },
  {
    "name": "Serratus Crunch (Cable)",
    "targetMuscles": [
      "Serratus Anterior",
      "Abs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Serratus Anterior, Abs, performing a controlled Serratus Crunch (Cable). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Serratus_Crunch__Cable_.png"
  },
  {
    "name": "Stomach Vacuum",
    "targetMuscles": [
      "Transverse Abdominis"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Transverse Abdominis, performing a controlled Stomach Vacuum. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Stomach_Vacuum.png"
  },
  {
    "name": "Adductor Machine",
    "targetMuscles": [
      "Inner Thighs"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Inner Thighs, performing a controlled Adductor Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Adductor_Machine.png"
  },
  {
    "name": "Abductor Machine",
    "targetMuscles": [
      "Outer Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Outer Glutes, performing a controlled Abductor Machine. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Abductor_Machine.png"
  },
  {
    "name": "Glute Ham Raise (Natural)",
    "targetMuscles": [
      "Hamstrings",
      "Glutes"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Hamstrings, Glutes, performing a controlled Glute Ham Raise (Natural). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Glute_Ham_Raise__Natural_.png"
  },
  {
    "name": "Block Pull (Below Knee)",
    "targetMuscles": [
      "Upper Back",
      "Traps"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Upper Back, Traps, performing a controlled Block Pull (Below Knee). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Block_Pull__Below_Knee_.png"
  },
  {
    "name": "Block Pull (Above Knee)",
    "targetMuscles": [
      "Traps",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Traps, Grip, performing a controlled Block Pull (Above Knee). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Block_Pull__Above_Knee_.png"
  },
  {
    "name": "Sandbag Clean & Press",
    "targetMuscles": [
      "Full Body",
      "Core",
      "Grip"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Full Body, Core, Grip, performing a controlled Sandbag Clean & Press. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Sandbag_Clean___Press.png"
  },
  {
    "name": "Medicine Ball Rotational Throw",
    "targetMuscles": [
      "Obliques",
      "Core Power"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Obliques, Core Power, performing a controlled Medicine Ball Rotational Throw. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Medicine_Ball_Rotational_Throw.png"
  },
  {
    "name": "Savasana (Corpse Pose)",
    "targetMuscles": [
      "Mental Recovery",
      "CNS Reset"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Mental Recovery, CNS Reset, performing a controlled Savasana (Corpse Pose). Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Savasana__Corpse_Pose_.png"
  },
  {
    "name": "Bar Muscle-Up",
    "targetMuscles": [
      "Lats",
      "Chest",
      "Triceps",
      "Core"
    ],
    "description": "Cinematic 3D anatomical animation, a translucent male muscle model with visible, glowing red muscle fibers in the Lats, Chest, Triceps, Core, performing a controlled Bar Muscle-Up. Neutral grey studio background with soft lighting, biomechanically accurate movement, smooth slow-motion loop, 4k resolution.",
    "imageUrl": "https://storage.googleapis.com/kaybee-fitness.firebasestorage.app/exercises/Bar_Muscle_Up.png"
  }
]